# IsConformal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..IsConformal Property
Transform Class See Also
---
The boolean value that indicates whether this transformation is conformal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsConformal { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsConformal As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsConformal {
	bool get ();
}
```

# Remarks
This property is true if this transformation can be decomposed as the product of a rigid-body motion, uniform scale and reflection. Such transformation preserves angles between vectors.
# See Also
Transform Class
Autodesk.Revit.DB Namespace